## SQLite

### SQLite is a self contained, serverless and zero configuration database engine that is widely used for embedded database systems. Unlike other relational databases like MySQL and Postgres SQLite runs inside our appllication and all read/write operatiions happens inside a single .db file . It only allows a single writer at a time.

### SQLite3 comes inbuilt with python

In [44]:
import sqlite3

In [45]:
connection=sqlite3.connect('database.db')
connection

#### To interact with the database and execute sql queries we need to make a cursor object

In [46]:
cursor = connection.cursor()

In [47]:
# Create a table
cursor.execute(''' 
CREATE TABLE IF NOT EXISTS 
    users (id INTEGER PRIMARY KEY AUTOINCREMENT, 
    name TEXT, 
    age INTEGER,
    department TEXT
    )
''')
#By default autocommit is off in SQLite, so we need to commit the changes
connection.commit()

In [48]:
cursor.execute(' SELECT * FROM users ')

In [49]:
#Insert the data
cursor.execute('''
    INSERT INTO users (name, age, department)
    VALUES ('Saurav', 20, 'Computer Science'),
           ('Swastika', 19, 'Biotechnology'),
           ('Gita', 28, 'Marketing')
''')
connection.commit()

In [50]:
data=cursor.execute(' SELECT * FROM users ')
rows=data.fetchall()
rows

[(1, 'Saurav', 20, 'Computer Science'),
 (2, 'Swastika', 20, 'Biotechnology'),
 (4, 'Saurav', 20, 'Computer Science'),
 (5, 'Swastika', 20, 'Biotechnology'),
 (7, 'Saurav', 20, 'Computer Science'),
 (8, 'Swastika', 20, 'Biotechnology'),
 (10, 'Saurav', 20, 'Computer Science'),
 (11, 'Swastika', 20, 'Biotechnology'),
 (13, 'Saurav', 20, 'Computer Science'),
 (14, 'Swastika', 20, 'Biotechnology'),
 (16, 'Saurav', 20, 'Computer Science'),
 (17, 'Swastika', 20, 'Biotechnology'),
 (19, 'Saurav', 20, 'Computer Science'),
 (20, 'Swastika', 20, 'Biotechnology'),
 (22, 'Saurav', 20, 'Computer Science'),
 (23, 'Swastika', 20, 'Biotechnology'),
 (25, 'Saurav', 20, 'Computer Science'),
 (26, 'Swastika', 20, 'Biotechnology'),
 (28, 'Saurav', 20, 'Computer Science'),
 (29, 'Swastika', 20, 'Biotechnology'),
 (31, 'Saurav', 20, 'Computer Science'),
 (32, 'Swastika', 20, 'Biotechnology'),
 (34, 'Saurav', 20, 'Computer Science'),
 (35, 'Swastika', 19, 'Biotechnology'),
 (36, 'Gita', 28, 'Marketing')]

In [51]:
print("Users in the database:")
for row in rows:
  print(f"ID: {row[0]}, Name: {row[1]}, Age: {row[2]}, Department: {row[3]}")

Users in the database:
ID: 1, Name: Saurav, Age: 20, Department: Computer Science
ID: 2, Name: Swastika, Age: 20, Department: Biotechnology
ID: 4, Name: Saurav, Age: 20, Department: Computer Science
ID: 5, Name: Swastika, Age: 20, Department: Biotechnology
ID: 7, Name: Saurav, Age: 20, Department: Computer Science
ID: 8, Name: Swastika, Age: 20, Department: Biotechnology
ID: 10, Name: Saurav, Age: 20, Department: Computer Science
ID: 11, Name: Swastika, Age: 20, Department: Biotechnology
ID: 13, Name: Saurav, Age: 20, Department: Computer Science
ID: 14, Name: Swastika, Age: 20, Department: Biotechnology
ID: 16, Name: Saurav, Age: 20, Department: Computer Science
ID: 17, Name: Swastika, Age: 20, Department: Biotechnology
ID: 19, Name: Saurav, Age: 20, Department: Computer Science
ID: 20, Name: Swastika, Age: 20, Department: Biotechnology
ID: 22, Name: Saurav, Age: 20, Department: Computer Science
ID: 23, Name: Swastika, Age: 20, Department: Biotechnology
ID: 25, Name: Saurav, Age: 20, Department: Computer Science
ID: 26, Name: Swastika, Age: 20, Department: Biotechnology
ID: 28, Name: Saurav, Age: 20, Department: Computer Science
ID: 29, Name: Swastika, Age: 20, Department: Biotechnology
ID: 31, Name: Saurav, Age: 20, Department: Computer Science
ID: 32, Name: Swastika, Age: 20, Department: Biotechnology
ID: 34, Name: Saurav, Age: 20, Department: Computer Science
ID: 35, Name: Swastika, Age: 19, Department: Biotechnology
ID: 36, Name: Gita, Age: 28, Department: Marketing

In [52]:
# Updating data
cursor.execute('UPDATE USERS SET age=20 WHERE name="Swastika"')
connection.commit()

In [53]:
cursor.execute(' SELECT * FROM users ')
rows=cursor.fetchall()
for row in rows:
  print(f"ID: {row[0]}, Name: {row[1]}, Age: {row[2]}, Department: {row[3]}")

ID: 1, Name: Saurav, Age: 20, Department: Computer Science
ID: 2, Name: Swastika, Age: 20, Department: Biotechnology
ID: 4, Name: Saurav, Age: 20, Department: Computer Science
ID: 5, Name: Swastika, Age: 20, Department: Biotechnology
ID: 7, Name: Saurav, Age: 20, Department: Computer Science
ID: 8, Name: Swastika, Age: 20, Department: Biotechnology
ID: 10, Name: Saurav, Age: 20, Department: Computer Science
ID: 11, Name: Swastika, Age: 20, Department: Biotechnology
ID: 13, Name: Saurav, Age: 20, Department: Computer Science
ID: 14, Name: Swastika, Age: 20, Department: Biotechnology
ID: 16, Name: Saurav, Age: 20, Department: Computer Science
ID: 17, Name: Swastika, Age: 20, Department: Biotechnology
ID: 19, Name: Saurav, Age: 20, Department: Computer Science
ID: 20, Name: Swastika, Age: 20, Department: Biotechnology
ID: 22, Name: Saurav, Age: 20, Department: Computer Science
ID: 23, Name: Swastika, Age: 20, Department: Biotechnology
ID: 25, Name: Saurav, Age: 20, Department: Computer Science
ID: 26, Name: Swastika, Age: 20, Department: Biotechnology
ID: 28, Name: Saurav, Age: 20, Department: Computer Science
ID: 29, Name: Swastika, Age: 20, Department: Biotechnology
ID: 31, Name: Saurav, Age: 20, Department: Computer Science
ID: 32, Name: Swastika, Age: 20, Department: Biotechnology
ID: 34, Name: Saurav, Age: 20, Department: Computer Science
ID: 35, Name: Swastika, Age: 20, Department: Biotechnology
ID: 36, Name: Gita, Age: 28, Department: Marketing

In [54]:
# Deleting data
cursor.execute('DELETE FROM users WHERE name="Gita"')
connection.commit()

In [55]:
cursor.execute(' SELECT * FROM users ')
rows=cursor.fetchall()
rows

[(1, 'Saurav', 20, 'Computer Science'),
 (2, 'Swastika', 20, 'Biotechnology'),
 (4, 'Saurav', 20, 'Computer Science'),
 (5, 'Swastika', 20, 'Biotechnology'),
 (7, 'Saurav', 20, 'Computer Science'),
 (8, 'Swastika', 20, 'Biotechnology'),
 (10, 'Saurav', 20, 'Computer Science'),
 (11, 'Swastika', 20, 'Biotechnology'),
 (13, 'Saurav', 20, 'Computer Science'),
 (14, 'Swastika', 20, 'Biotechnology'),
 (16, 'Saurav', 20, 'Computer Science'),
 (17, 'Swastika', 20, 'Biotechnology'),
 (19, 'Saurav', 20, 'Computer Science'),
 (20, 'Swastika', 20, 'Biotechnology'),
 (22, 'Saurav', 20, 'Computer Science'),
 (23, 'Swastika', 20, 'Biotechnology'),
 (25, 'Saurav', 20, 'Computer Science'),
 (26, 'Swastika', 20, 'Biotechnology'),
 (28, 'Saurav', 20, 'Computer Science'),
 (29, 'Swastika', 20, 'Biotechnology'),
 (31, 'Saurav', 20, 'Computer Science'),
 (32, 'Swastika', 20, 'Biotechnology'),
 (34, 'Saurav', 20, 'Computer Science'),
 (35, 'Swastika', 20, 'Biotechnology')]

In [56]:
cursor.close()
connection.close()

### CRUD Operations with Students data

In [57]:
connection = sqlite3.connect('students.db')
cursor = connection.cursor()

# Create students table
cursor.execute('''
CREATE TABLE IF NOT EXISTS students (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT,
    age INTEGER,
    grade TEXT,
    department TEXT
)
''')

connection.commit()

In [58]:
students_data = [
    ('Saurav', 20, 'A', 'Computer Science'),
    ('Swastika', 19, 'B', 'Biotechnology'),
    ('Gita', 18, 'A', 'Marketing'),
    ('Ramesh', 21, 'C', 'Finance'),
    ('Anita', 20, 'B', 'HR'),
    ('Bikash', 22, 'A', 'Operations'),
    ('Deepa', 19, 'B', 'Marketing'),
    ('Hari', 23, 'C', 'IT Support'),
    ('Kiran', 21, 'A', 'Finance'),
    ('Laxmi', 20, 'B', 'HR'),
    ('Manoj', 22, 'A', 'Computer Science'),
    ('Nisha', 19, 'B', 'Biotechnology'),
    ('Omkar', 23, 'C', 'Operations'),
    ('Pooja', 20, 'A', 'Marketing'),
    ('Ravi', 22, 'B', 'Finance'),
    ('Sita', 21, 'A', 'HR'),
    ('Tara', 19, 'C', 'IT Support'),
    ('Umesh', 20, 'B', 'Computer Science'),
    ('Vikash', 22, 'A', 'Operations'),
    ('Yamini', 21, 'B', 'Biotechnology')
]


#Bulk insert with executemany
cursor.executemany('''
    INSERT INTO students (name, age, grade, department)
    VALUES (?, ?, ?, ?)
''', students_data)

connection.commit()

In [59]:
cursor.execute('SELECT * FROM students')
rows=cursor.fetchall()
for row in rows:
  print(f"ID: {row[0]}, Name: {row[1]}, Age: {row[2]}, Grade: {row[3]}, Department: {row[4]}")

ID: 221, Name: Saurav, Age: 20, Grade: A, Department: Computer Science
ID: 222, Name: Swastika, Age: 19, Grade: B, Department: Biotechnology
ID: 223, Name: Gita, Age: 18, Grade: A, Department: Marketing
ID: 224, Name: Ramesh, Age: 21, Grade: C, Department: Finance
ID: 225, Name: Anita, Age: 20, Grade: B, Department: HR
ID: 226, Name: Bikash, Age: 22, Grade: A, Department: Operations
ID: 227, Name: Deepa, Age: 19, Grade: B, Department: Marketing
ID: 228, Name: Hari, Age: 23, Grade: C, Department: IT Support
ID: 229, Name: Kiran, Age: 21, Grade: A, Department: Finance
ID: 230, Name: Laxmi, Age: 20, Grade: B, Department: HR
ID: 231, Name: Manoj, Age: 22, Grade: A, Department: Computer Science
ID: 232, Name: Nisha, Age: 19, Grade: B, Department: Biotechnology
ID: 233, Name: Omkar, Age: 23, Grade: C, Department: Operations
ID: 234, Name: Pooja, Age: 20, Grade: A, Department: Marketing
ID: 235, Name: Ravi, Age: 22, Grade: B, Department: Finance
ID: 236, Name: Sita, Age: 21, Grade: A, Department: HR
ID: 237, Name: Tara, Age: 19, Grade: C, Department: IT Support
ID: 238, Name: Umesh, Age: 20, Grade: B, Department: Computer Science
ID: 239, Name: Vikash, Age: 22, Grade: A, Department: Operations
ID: 240, Name: Yamini, Age: 21, Grade: B, Department: Biotechnology

In [60]:
cursor.execute('SELECT * FROM students WHERE age>22')
data = cursor.fetchall()
for row in data:
  print(f"ID: {row[0]}, Name: {row[1]}, Age: {row[2]}, Department: {row[3]}")

ID: 228, Name: Hari, Age: 23, Department: C
ID: 233, Name: Omkar, Age: 23, Department: C

In [61]:
cursor.execute(' DELETE FROM students WHERE Grade="C" ')
connection.commit()

In [62]:
cursor.execute(' SELECT Name from students WHERE Department="Marketing" ')
data=cursor.fetchall()
data

[('Gita',), ('Deepa',), ('Pooja',)]

In [63]:
def fetch_user_by_letter(letter):
    cursor.execute('SELECT Name from students where Name LIKE ?',(letter+'%',))
    data=cursor.fetchall()
    return data

data=fetch_user_by_letter('S')
for row in data:
  print(row[0])

Saurav
Swastika
Sita

### Handling Transactions in SQLite3

In [64]:
def insert_mutiple_students(student1,student2):
  try:
    cursor.execute('INSERT INTO students VALUES (?,?,?,?,?)',student1)
    cursor.execute('INSERT INTO students VALUES (?,?,?,?,?)',student2)
    connection.commit() #Commit the changes
    print('Insertion successful')
  except Exception as e:
    print('An error occured',e)
    connection.rollback() #Rollback in case of error
  

insert_mutiple_students( (100,'Zara',20,'A','Computer Science'), (200,'Zayn',21,'B','Biotechnology') )

Insertion successful

### Indexing and Optimization

In [65]:
def create_index():
  try:
    cursor.execute('CREATE INDEX idx_name on students(name)')
    print('Index created successfully')
  except Exception as e:
    print('An error occured while creating index',e)

create_index()

Index created successfully

### Backing Up and Restoring Data

In [66]:
import shutil
def backup_database(source_db, backup_db):
    try:
        shutil.copy(source_db, backup_db)
        print(f'Backup of {source_db} created as {backup_db}')
    except Exception as e:
        print('An error occurred during backup:', e)
        
backup_database('students.db','students_backup.db')

Backup of students.db created as students_backup.db

In [67]:
def restore_database(backup_db, source_db):
    try:
        shutil.copy(backup_db, source_db)
        print(f'Database {source_db} restored from {backup_db}')
    except Exception as e:
        print('An error occurred during restoration:', e)
        
restore_database('students_backup.db', 'students.db')

Database students.db restored from students_backup.db